package day1.task3;

/**
 * Вывести на экран слово “JAVA”, в столбик, чтобы оно повторилось 10 раз
 */
public class Main {
    public static void main(String[] args) {
        for (int i = 0; i < 10; i++) {
            System.out.println("JAVA");
        }
    }
}
